Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.module.minio.helm_release.minio must be replaced
-/+ resource "helm_release" "minio" {
      ~ id                         = "minio" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "2024.7.4"
              - chart       = "minio"
              - name        = "minio"
              - namespace   = "default"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - auth              = {
                          - rootPassword = "admin"
                        }
                      - namespaceOverride = "minio"
                      - persistence       = {
                          - size         = "3Gi"
                          - storageClass = "local-storage-class"
                        }
                      - volumePermissions = {
                          - enabled = true
                        }
                    }
                )
              - version     = "14.6.19"
            },
        ] -> (known after apply)
        name                       = "minio"
      ~ status                     = "failed" -> "deployed"
      ~ version                    = "14.6.19" -> (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.kubernetes.module.minio.kubernetes_manifest.minio-namespace will be created
+ resource "kubernetes_manifest" "minio-namespace" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + name = "minio"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "minio"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + finalizers = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`